Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: // Prints "theAceOfSpades: suit is ♠, value is 1 or 11"
ja: （「theAceOfSpades: 組み札は♠、値は１または11です」を出力します）

source: // Prints "true"
ja: （「true」を出力します）

source: // Prints "unusualMenagerie has 40 characters"
ja: （「unusualMenagerieは、40の文字を持ちます」を出力します）

source: // Random dice roll is 3
ja: （無作為にさいころを転がして、３です）

source: // Random dice roll is 4
ja: （無作為にさいころを転がして、４です）

source: // Random dice roll is 5
ja: （無作為にさいころを転がして、５です）

source: // Reimplement the Swift standard library's optional type
ja: （スウィフト標準ライブラリのオプショナル型の再実装）

source: // Return an appropriate subscript value here.
ja: （適切な添え字値をここで返す。）

source: // Return the appropriate value
ja: （適切な値を返す）

source: // Rolled a 3
ja: （３を出した）

source: // Rolled a 4
ja: （４を出した）

source: // Rolled a 5
ja: （５を出した）

source: // Setting 'index' to a new value doesn't affect 'path'
ja: （'index'を新しい値に設定することは、'path'に影響を与えない）

source: // Six eggs
ja: （卵６つ）

source: // Something that doesn't have an area
ja: （面積を持たない何か）

source: // Song: Blue Suede Shoes, by Elvis Presley
ja: （歌：『青い裏革靴』、エルヴィス・プレスリー）

source: // Song: Never Gonna Give You Up, by Rick Astley
ja: （歌：『諦めないで』、リック・アストリー）

source: // Song: The One And Only, by Chesney Hawkes
ja: （歌：『唯一無二の』、チェズニー・ホークス）

source: // Started a new game of Snakes and Ladders
ja: （ヘビとはしごの新しいゲームを始める）

source: // Subsequent release renames MyProtocol
ja: （続くリリースでMyProtocolに改名する）

source: // Tandem: traveling at 22.0 miles per hour
ja: （２人乗り：時速22.0マイルで運行中）

source: // The compile-time type of someInstance is SomeBaseClass,
ja: （someInstanceのコンパイル時での型は、SomeBaseClassです、）

source: // The following dictionaries have the same type.
ja: （以下の辞書は同じ型を持ちます。）

source: // The game is using a 6-sided dice
ja: （ゲームは、６面のさいころを使っています）

source: // The game lasted for 4 turns
ja: （ゲームは、４回続きました）

source: // The line below calls makeIndex().
ja: （下の行は makeIndex() を呼び出します。）

source: // The type of optionalString is "String?" and assumedString isn't force-unwrapped.
ja: （optionalString の型は "String?" です、そして assumedString は強制アンラップされません。）

source: // This assertion fails because -3 is not >= 0.
ja: （この表明は失敗する、なぜなら-3 は >= 0 ではないから。）

source: // This code isn't valid.
ja: （このコードは有効ではありません。）

source: // This is a comment.
ja: （これはコメントです。）

source: // This is a compile-time error: languageName cannot be changed.
ja: （これはコンパイル時エラーです：anguageNameは変わることができません。）

source: // This is not valid, because x = y does not return a value.
ja: （これは有効ではありません、x = yが値を返さないので。）

source: // This syntax is preferred.
ja: （この構文はより好まれます。）

source: // This syntax produces a warning.
ja: （この構文は警告を生成します。）

source: // This triggers an assert, because [2, 2] is outside of the matrix bounds.
ja: （これはある表明の引き金となります、なぜなら [2, 2] はマトリックス境界の外であるからです。）

source: // This will report a compile-time error.
ja: （これは、コンパイル時エラーを報告します。）

source: // Type annotation is required because String has multiple initializers.
ja: （型注釈は必須です、なぜならStringは複数のイニシャライザを持つからです。）

source: // UInt8 cannot store negative numbers, and so this will report an error
ja: （UInt8は負の数を格納することができません、それでこれはエラーを報告します）

source: // Update the original.
ja: （元のものを更新する。）

source: // Use a dynamic method call.
ja: （動的メソッド呼び出しを使います。）

source: // Use iOS 10 APIs on iOS, and use macOS 10.12 APIs on macOS
ja: （iOS 10 APIをiOSで、macOS 10.12 APIをmacOSで使う）

source: // Using taskKeyPath doesn't call makeIndex() again.
ja: （ taskKeyPath を使うことは、 makeIndex() を再び呼び出しません。）

source: // Vehicle: 0 wheel(s)
ja: （乗り物: ０輪）

source: // Vehicle: traveling at 0.0 miles per hour
ja: （Vehicle: 時速0.0マイルで運行中）

source: // Weak capture of "self.parent" as "parent"
ja: （「parent」としての弱いキャプチャ「self.parent」）

source: // Work with the file.
ja: （ファイル処理。）

source: // a is "test", b is 12, c is 3, and 9.45 is ignored
ja: （aは「test」です、bは12です、cは３です、そして9.45は無視されます）

source: // a is now equal to 10
ja: （aは今は10と等しい）

source: // a is now equal to 3
ja: （aは現在、３と等しい）

source: // a movie called Ghostbusters, dir. Ivan Reitman
ja: （『ゴーストバスターズ』と呼ばれる映画、監督アイヴァン・ライトマン）

source: // a positive double value of 3.14159
ja: （正の浮動小数点の値の3.14159）

source: // a string value of "hello"
ja: （文字列値の「よろしく」）

source: // afterDoubling also has values of (2.0, 8.0)
ja: （afterDoublingも(2.0, 8.0)の値を持ちます）

source: // alsoPositive is a Vector2D instance with values of (3.0, 4.0)
ja: （alsoPositiveは、値(-3.0, -4.0)をもつVector2Dインスタンです）

source: // an (x, y) point at 3.0, 5.0
ja: （3.0、5.0の(x, y)座標点）

source: // an error was thrown
ja: （エラーがスローされた）

source: // an integer value of 42
ja: （整数値の42）

source: // and so this will also report an error
ja: （それでこれも同様にエラーを報告します）

source: // and the runtime type of someInstance is SomeSubClass
ja: （そしてsomeInstanceの実行時での型は、SomeSubClassです）

source: // anonymousCreature is of type Animal?, not Animal
ja: （anonymousCreatureは、型Animal?です、Animalではなく）

source: // anotherMathFunction is inferred to be of type (Int, Int) -> Int
ja: （anotherMathFunctionは、型(Int, Int) -> Intであると推論されます）

source: // anotherPi is also inferred to be of type Double
ja: （anotherPiもまたDouble型であると推論されます）

source: // anotherThreeDoubles is of type [Double], and equals [2.5, 2.5, 2.5]
ja: （anotherThreeDoublesは、型[Double]で、[2.5, 2.5, 2.5]に等しいです）

source: // ants have 6 legs
ja: （蟻は、６本の足を持っています）

source: // basicRect's origin is (0.0, 0.0) and its size is (0.0, 0.0)
ja: （centerRectの原点は(0.0, 0.0)、そのサイズは(0.0, 0.0)です）

source: // beginning is "Hello"
ja: （beginningは "Hello" です）

source: // bodyTemperature.temperatureInCelsius is 37.0
ja: （bodyTemperature.temperatureInCelsius は 37.0 です）

source: // boilingPointOfWater.temperatureInCelsius is 100.0
ja: （boilingPointOfWater.temperatureInCelsiusは、100.0です）

source: // cap the new audio level to the threshold level
ja: （新しい音声レベルを限界レベルに制限する）

source: // cats have 4 legs
ja: （猫は、４本の足を持っています）

source: // centerRect's origin is (2.5, 2.5) and its size is (3.0, 3.0)
ja: （centerRectの原点は(2.5, 2.5)、そのサイズは(3.0, 3.0)です）

source: // class definition goes here
ja: （クラス定義が、ここにきます）

source: // class-only protocol definition goes here
ja: （クラス専用プロトコル定義が、ここにきます）

source: // close(file) is called here, at the end of the scope.
ja: （close(file)がここで呼ばれます、このスコープの終わりで。）

source: // closure body goes here
ja: （クロージャ本文が、ここにきます）

source: // closure's body goes here
ja: （クロージャの本文がここにきます）

source: // combinedVector is a Vector2D instance with values of (5.0, 5.0)
ja: （combinedVectorは(5.0, 5.0)の値をもつVector2Dインスタンスです）

source: // conformance to the Container protocol
ja: （Containerプロトコルに準拠）

source: // convertedNumber is inferred to be of type "Int?", or "optional Int"
ja: （convertedNumberは、型「Int?」または「オプショナルのInt」であると推論されます）

source: // create a default value for someProperty inside this closure
ja: （このクロージャの内側でsomePropertyのための省略時の値をつくる）

source: // customersInLine is ["Alex", "Ewa", "Barry", "Daniella"]
ja: （customersInLine（並んでいる顧客）は、["Alex", "Ewa", "Barry", "Daniella"]です）

source: // customersInLine is ["Barry", "Daniella"]
ja: （customersInLine（並んでいる顧客）は、["Barry", "Daniella"]です）

source: // customersInLine is ["Ewa", "Barry", "Daniella"]
ja: （customersInLine（並んでいる顧客）は、["Ewa", "Barry", "Daniella"]です）

source: // diceRoll will move us beyond the final square, so roll again
ja: （diceRollは私たちを最後の正方形を越えて動かします、それで再度転がします）

source: // diceRoll will move us to the final square, so the game is over
ja: （diceRollは私たちを最後の正方形に動かします、なのでゲームは終わりです）

source: // discard 'self' and return 'nil'
ja: （「self」を廃棄して「nil」を返します）

source: // do nothing - an arbitrary vehicle doesn't necessarily make a noise
ja: （何もしない - ある任意の乗り物が必ず音を出すわけではない）

source: // do something with the instance of 'SomeStruct'
ja: （「SomeStruct」のインスタンスで何か行う）

source: // doubleIndex is an optional Int with no value, because 9.3 isn't in the array
ja: （9.3がこの配列の中にはないので、doubleIndexは値のないオプショナルのIntです）

source: // eAcute is é, combinedEAcute is é
ja: （eAcuteはéです、combinedEAcuteはéです）

source: // earthsOrder is 3
ja: （earthsOrderは、３です）

source: // enclosedEAcute is é⃝
ja: （enclosedEAcute は é⃝ です）

source: // enumeration definition goes here
ja: （列挙定義がここにきます）

source: // f is a function of type (Int) -> Number
ja: （fは型(Int) -> Numberの関数です）

source: // favoriteGenres has been initialized with three initial items
ja: （favoriteGenresは３つの初期項目で初期化されています）

source: // favoriteGenres now contains 4 items
ja: （favoriteGenresは現在４項目を含みます）

source: // firstItem is equal to "Eggs"
ja: （firstItemは、「Eggs」と等しいです）

source: // firstItem is now equal to "Six eggs"
ja: （firstItemは、現在「６つの卵」と等しいです）

source: // for that parameter.
ja: （そのパラメータのための引数値に言及することができます。）

source: // freezingPointOfWater.temperatureInCelsius is 0.0
ja: （freezingPointOfWater.temperatureInCelsiusは、0.0です）

source: // friendlyWelcome is now "Bonjour!"
ja: （friendlyWelcomeは、現在「Bonjour!」です）

source: // fromTheTop is equal to "cuatro", and the stack now contains 3 strings
ja: （fromTheTopは「cuatro」と等しいです、そしてスタックは現在は３つの文字列を含みます）

source: // function body goes here
ja: （関数本文が、ここにきます）

source: // function implementation goes here
ja: （関数実装が、ここにきます）

source: // heartsSymbol is "♡"
ja: （heartsSymbol は "♡" です）

source: // http404Error is of type (Int, String), and equals (404, "Not Found")
ja: （http404Errorは、型が(Int, String)です、そして(404, "Not Found")と等しいです）

source: // if we're still on the board, move up or down for a snake or a ladder
ja: （私達がまだ盤上ならば、ヘビまたははしごに対して上／下に移動する）

source: // implementation of protocol requirements goes here
ja: （プロトコル要件の実装が、ここにきます）

source: // initialization of 'SomeStruct' failed and the initializer returned 'nil'
ja: （「SomeStruct」の初期化は失敗したのでイニシャライザは「nil」を返した）

source: // initializer implementation goes here
ja: （イニシャライザ実装がここに来ます）

source: // instruction now equals "look over there"
ja: （instructionは、現在「あそこを見て」に等しい）

source: // integerPi equals 3, and is inferred to be of type Int
ja: （integerPiは、３に等しく、型Intであると推測されます）

source: // its value is ["OneSix", "FiveEight", "FiveOneZero"]
ja: （その値は["OneSix", "FiveEight", "FiveOneZero"]です）

source: // john.fullName is "John Appleseed"
ja: （john.fullNameは、「John Appleseed」です）

source: // letters is now an empty set, but is still of type Set<Character>
ja: （lettersは現在空の集合です、しかし依然として型Set<Character>です）

source: // letters now contains 1 value of type Character
ja: （lettersは型Characterの値を１つ持ちます）

source: // lightSwitch is now equal to .on
ja: （lightSwitchは、現在.onと等しいです）

source: // maxAmplitudeFound is now 0
ja: （maxAmplitudeFoundは、現在0です）

source: // meaningOfLife is inferred to be of type Int
ja: （meaningOfLifeはInt型であると推測されます）

source: // message is "3 times 2.5 is 7.5"
ja: （messageは、「３かける2.５は7.５」です）

source: // move by the rolled amount
ja: （振られた量だけ移動）

source: // move up or down for a snake or ladder
ja: （ヘビまたははしごのための上下移動）

source: // moveNearerToZero now refers to the nested stepForward() function
ja: （moveNearerToZeroは、現在は入れ子にされたstepForward()関数に言及します）

source: // moveNearerToZero now refers to the stepBackward() function
ja: （moveNearerToZeroは、現在はstepBackward()関数に言及します）

source: // myGreeting is 'hola'
ja: （myGreeting は 'hola' です）

source: // mysteryMeat's name is "[Unnamed]"
ja: （nameMeatの名前は「[Unnamed]」です）

source: // namedMeat's name is "Bacon"
ja: （nameMeatの名前は「ベーコン」です）

source: // namesOfIntegers is an empty [Int: String] dictionary
ja: （namesOfIntegersは、空の[Int: String]の辞書です）

source: // namesOfIntegers is once again an empty dictionary of type [Int: String]
ja: （namesOfIntegersは、またもとのように型[Int: String]の空の辞書です）

source: // namesOfIntegers now contains 1 key-value pair
ja: （namesOfIntegersは、現在は１つの「キーと値」の対を含みます）

source: // ncc1701.fullName is "USS Enterprise"
ja: （ncc1701.fullNameは、USSエンタープライズです）

source: // negative is a Vector2D instance with values of (-3.0, -4.0)
ja: （negativeは、値(-3.0, -4.0)をもつVector2Dインスタンです）

source: // nested Rank enumeration
ja: （入れ子にされたRank列挙）

source: // nested Suit enumeration
ja: （入れ子にされたSuit列挙）

source: // nestedValue is 24
ja: （nestedValue は 24 です）

source: // new functionality to add to SomeType goes here
ja: （SomeTypeに加える新しい機能性が、ここにきます）

source: // no error was thrown
ja: （エラーはスローされなかった）

source: // originRect's origin is (2.0, 2.0) and its size is (5.0, 5.0)
ja: （centerRectの原点は (2.0, 2.0)、そのサイズは(5.0, 5.0)です）

source: // original IntStack implementation
ja: （元々のIntStack実施）

source: // original Stack<Element> implementation
ja: （元々のStack<Element>実装）

source: // original now has values of (4.0, 6.0)
ja: （originalは、現在(4.0, 6.0)の値を持ちます）

source: // ovenLight is now equal to .high
ja: （ovenLightは現在.hightと等しい）

source: // ovenLight is now equal to .off
ja: （ovenLightは現在.lowと等しい）

source: // perform some initialization here
ja: （ここで何らかの初期化を行う）

source: // perform the deinitialization
ja: （デイニシャライズを実行する）

source: // pi equals 3.14159, and is inferred to be of type Double
ja: （piは、3.14159に等しく、型Doubleであると推論されます）

source: // pi is inferred to be of type Double
ja: （パイはDouble型であると推測されます）

source: // plusMinusVector is a Vector2D instance with values of (4.0, -2.0)
ja: （plusMinusVectorはVector2Dインスタンスで(4.0, -2.0)の値をもちます）

source: // possiblePlanet is of type Planet? and equals Planet.uranus
ja: （possiblePlanetは、型Planet?で、Planet.uranusに等しい）

source: // potentialOverflow equals 32767, which is the maximum value an Int16 can hold
ja: （potentialOverflowは32767と等しく、それはInt16が持つことができる最大限の値です）

source: // precomposed is 한, decomposed is 한
ja: （合成済は「한」, 分解したものは「한」です）

source: // print(protocolValue.anotherProperty) // Uncomment to see the error
ja: // print(protocolValue.anotherProperty) // コメントを外すとエラー

source: // prints "hello, world" and returns a value of 12
ja: （「よろしく、世界」を出力して値12を返します）

source: // prints "hello, world" but does not return a value
ja: （「よろしく、世界」を出力しますが値を返しません）

source: // produces an optional instance of 'SomeStruct'
ja: （「SomeStruct」のオプショナルインスタンスを生成します）

source: // protocol definition
ja: （プロトコル定義）

source: // protocol definition goes here
ja: （プロトコル定義が、ここにきます）

source: // refer to the argument values for the first and second parameters.
ja: （最初と２番目のパラメーターに対する引き数の値を参照します。）

source: // regionalIndicatorForUS is 🇺🇸
ja: （regionalIndicatorForUS は 🇺🇸 です）

source: // render the tick mark each minute (60 times)
ja: （各分に目盛りを描画する（60回））

source: // render the tick mark every 3 hours (3, 6, 9, 12)
ja: （３時間ごとに目盛りを描画する（3, 6, 9, 12））

source: // render the tick mark every 5 minutes (0, 5, 10, 15 ... 45, 50, 55)
ja: （５分毎に目盛りを描画する（0, 5, 10, 15 ... 45, 50, 55））

source: // returns 0, as if you had requested:
ja: （まるであなたが次のように要請したかのように、0を返します：）

source: // returns 10.0, which is the arithmetic mean of these three numbers
ja: （10.0を返します、それはこれら３つの数の算術平均です）

source: // returns 2
ja: （2を返します）

source: // returns 3.0, which is the arithmetic mean of these five numbers
ja: （3.0を返します、それはこれら５つの数の算術平均です）

source: // returns 5
ja: （5を返します）

source: // returns 7
ja: （7を返します）

source: // returns 9
ja: （9を返します）

source: // returns a value of 10
ja: （値10を返す）

source: // returns a value of 20
ja: （値20を返す）

source: // returns a value of 30
ja: （値30を返す）

source: // returns a value of 40
ja: （値40を返す）

source: // returns a value of 50
ja: （値50を返す）

source: // returns a value of 60
ja: （値60を返す）

source: // returns a value of 7
ja: （値7を返す）

source: // reversedNames is equal to ["Ewa", "Daniella", "Chris", "Barry", "Alex"]
ja: （reversedNamesは["Ewa", "Daniella", "Chris", "Barry", "Alex"]に等しい）

source: // roll the dice
ja: （さいころを振る）

source: // rowHeight is equal to 90
ja: （rowHeightは、90と等しい）

source: // serverResponseCode contains an actual Int value of 404
ja: （serverResponseCodeは、実際にあるInt値404を含みます）

source: // serverResponseCode now contains no value
ja: （serverResponseCodeは、現在は値を含みません）

source: // shoppingList has been initialized with two initial items
ja: （shoppingListが、２つの最初の項目で初期化された）

source: // shoppingList now contains 3 items, and someone is making pancakes
ja: （shoppingListは現在３つの項目を含みます、そして誰かはパンケーキを作っています）

source: // shoppingList now contains 4 items
ja: （shoppingListは、現在４つの項目を含みます）

source: // shoppingList now contains 5 items, and no apples
ja: （shoppingListは現在は５つの項目を含みます、そして「リンゴ」は含みません）

source: // shoppingList now contains 6 items
ja: （shoppingListは、現在６つの項目を含みます）

source: // shoppingList now contains 6 items, and no Maple Syrup
ja: （shoppingListは、現在６つの項目、メープルシロップ以外を含みます）

source: // shoppingList now contains 7 items
ja: （shoppingListは、現在７つの項目を含みます）

source: // signedOverflow equals -128, which is the minimum value an Int8 can hold
ja: （signedOverflowは-128と等しく、それはInt8が持つことができる最小限の値です）

source: // signedOverflow is now equal to 127
ja: （signedOverflowは、現在127と等しいです）

source: // sixDoubles is inferred as [Double], and equals [0.0, 0.0, 0.0, 2.5, 2.5, 2.5]
ja: （sixDoublesは、[Double]と推論され、 [0.0, 0.0, 0.0, 2.5, 2.5, 2.5]に等しいです）

source: // someCreature is of type Animal?, not Animal
ja: （someCreatureは、型Animal?です、Animalではなく）

source: // someDictionary is now ["a": [100, 2, 3], "b": [10, 20]]
ja: （someDictionary は、現在 ["a": [100, 2, 3], "b": [10, 20]] です）

source: // someDictionary is now ["a": [42, 2, 3], "b": [10, 20]]
ja: （omeDictionary は、現在 ["a": [42, 2, 3], "b": [10, 20]] です）

source: // someDictionary is still ["a": [1, 2, 3], "b": [10, 20]]
ja: （someDictionary は、まだ ["a": [1, 2, 3], "b": [10, 20]] です）

source: // someFunction takes an integer and a closure as its arguments
ja: （someFunctionは、その引数として整数とクロージャをとります）

source: // someFunctionWithSideEffects is evaluated and returns 42
ja: （someFunctionWithSideEffectsは、評価されて42を返します）

source: // someFunctionWithSideEffects is not evaluated
ja: （someFunctionWithSideEffectsは、評価されません。）

source: // someInt is now 107, and anotherInt is now 3
ja: （someIntは今は107、anotherIntは今は３です）

source: // someInt is now 9
ja: （someIntは、現在９です）

source: // someInts is now an empty array, but is still of type [Int]
ja: （someIntsは、現在は空の配列です、しかし依然として型[Int]です）

source: // someInts now contains 1 value of type Int
ja: （someIntsは、現在は型Intの値ひとつを含みます）

source: // someMethod takes a closure as its only argument
ja: （someMethodは、そのただ１つの引数としてクロージャをとります）

source: // someString is now "world", and anotherString is now "hello"
ja: （someStringは今は「world」、anotherStringは今は「hello」です）

source: // someValue must be of the same type as SomeType
ja: （someValueは、SomeTypeと同じ型でなければなりません）

source: // spiders have 8 legs
ja: （蜘蛛は、８本の足を持っています）

source: // stepSize is now 2
ja: （stepSize は現在 2 です）

source: // store this as the new overall maximum input level
ja: （これを新しい全体で最大の入力レベルとして格納する）

source: // stringIndex is an optional Int containing a value of 2
ja: （stringIndexは、オプショナルのIntで値２を含んでいます）

source: // strings is inferred to be of type [String]
ja: （stringsは型[String]と推論されます）

source: // structure definition goes here
ja: （構造体定義が、ここにきます）

source: // subclass definition goes here
ja: （サブクラス定義がここに来ます）

source: // subclass implementation of the required initializer goes here
ja: （必須イニシャライザのサブクラス実装がここに来ます）

source: // subclass initialization goes here
ja: （サブクラスの初期化が、ここにきます）

source: // suffix contains 20 and 30
ja: （suffix は 20 と 30を含む）

source: // sunsetDirection is "west"
ja: （sunsetDirectionは、「west」です）

source: // super.init() implicitly called here
ja: （super.init() が暗黙的にここで呼び出されます）

source: // surveyAnswer is automatically set to nil
ja: （surveyAnswerは、自動的にnilに設定されます）

source: // the "Dave" array is now [91, 82, 84] and the "Bev" array is now [80, 94, 81]
ja: （「Dave」配列は現在[91, 82, 84]です、そして「Bev」配列は現在[80, 94, 81]です）

source: // the DataImporter class would provide data importing functionality here
ja: （DataImporterクラスは、データをインポートする機能性をここで提供します）

source: // the DataImporter instance for the importer property has not yet been created
ja: （importerプロパティのためのDataImporterインスタンスは、まだ作成されていません）

source: // the DataImporter instance for the importer property has now been created
ja: （importerプロパティのためのDataImporterインスタンスが、今つくられました）

source: // the DataManager class would provide data management functionality here
ja: （DataManagerクラスは、データ管理の機能性をここで提供します）

source: // the airports dictionary now contains 3 items
ja: （airports辞書は、現在３つの項目を含みます）

source: // the apples constant is now equal to the removed "Apples" string
ja: （apples定数は、現在は削除された文字列「リンゴ」と等しいです）

source: // the counter's value is now 0
ja: （counterの値は、いま0です）

source: // the counter's value is now 1
ja: （counterの値は、いま１です）

source: // the counter's value is now 6
ja: （counterの値は、いま６です）

source: // the first item in the list is now equal to "Six eggs" rather than "Eggs"
ja: （リストの中の最初の項目は、現在「６つの卵」と等しいです、「卵」ではなく）

source: // the initial counter value is 0
ja: （counterの最初の値は、0です）

source: // the item that was at index 0 has just been removed
ja: （インデックス0であった項目が、ちょうど今取り除かれました）

source: // the last item in the array has just been removed
ja: （配列での最後の項目が、ちょうど今取り除かれました）

source: // the mapleSyrup constant is now equal to the removed "Maple Syrup" string
ja: （定数mapleSyrupは、現在は削除された「メープルシロップ」文字列と等しいです）

source: // the range now represents integer values 6, 7, and 8
ja: （範囲は、現在は整数値６、７、そして８を表します）

source: // the range represents integer values 0, 1, and 2
ja: （範囲は、整数値０、１、そして２を表します）

source: // the stack now contains 4 strings
ja: （スタックは、現在４つの文字列を含みます）

source: // the type of "library" is inferred to be [MediaItem]
ja: （「library」の型は、[MediaItem]であると推測されます）

source: // the value for "LHR" has been changed to "London Heathrow"
ja: （「LHR」に対する値は、「ロンドン・ヒースロー」に変えられました）

source: // the value of parameterWithDefault is 12 inside the function body.
ja: （parameterWithDefaultの値はこの関数本文の内部で12です。）

source: // these two strings are both empty, and are equivalent to each other
ja: （これらの２つの文字列は両方とも空で、お互いに等しいです）

source: // this causes an error
ja: （これは、エラーを引き起こします）

source: // this equals 17
ja: （これは17に等しい）

source: // this example will compile successfully
ja: （この例は、うまくコンパイルします）

source: // this example will not compile, and will report an error
ja: （この例はコンパイルせず、エラーを報告します）

source: // this function may or may not throw an error
ja: （この関数はエラーをスローするかもしれないししないかもしれない）

source: // this initializer creates a document with a nil name value
ja: （このイニシャライザはnilのname値を使って書類を作成します）

source: // this initializer creates a document with a nonempty name value
ja: （このイニシャライザは空でないname値を使って書類を作成します）

source: // this is a valid move, so find out its effect
ja: （これは有効な動きです、それでその効果を調べます）

source: // this range represents integer values 0, 1, 2, and 3
ja: （この範囲構造体、整数値０、１、２、そして３を表します）

source: // this reports a compile-time error - a constant string cannot be modified
ja: （これはコンパイル時エラー - 定数文字列は修正できません、を報告します）

source: // this reports a compile-time error - argument labels are required
ja: （これはコンパイル時エラーを報告します - 引数ラベルが必要とされます）

source: // this triggers a runtime error
ja: （これは、実行時エラーの引き金となります）

source: // this will report an error
ja: （これは、エラーを報告します）

source: // this will report an error, even though firstValue is a variable property
ja: （これはエラーを報告します、たとえfirstValueが変数プロパティであるとしてもです）

source: // threeDoubles is of type [Double], and equals [0.0, 0.0, 0.0]
ja: （threeDoublesは、型[Double]で、 [0.0, 0.0, 0.0]に等しいです）

source: // toBeDoubled now has values of (2.0, 8.0)
ja: （toBeDoubledは、現在(2.0, 8.0)の値を持ちます）

source: // trailing closure's body goes here
ja: （後付クロージャの本文がここにきます）

source: // type method implementation goes here
ja: （型メソッドの実施が、ここにきます）

source: // unsignedOverflow equals 0, which is the minimum value a UInt8 can hold
ja: （unsignedOverflowは0と等しく、それはUInt8が持つことができる最小限の値です）

source: // unsignedOverflow equals 255, which is the maximum value a UInt8 can hold
ja: （unsignedOverflowは255に等しく、それはUInt８が持つことができる最大限の値です）

source: // unsignedOverflow is now equal to 0
ja: （unsignedOverflowは、現在0と等しいです）

source: // unsignedOverflow is now equal to 255
ja: （unsignedOverflowは、現在255と等しいです）

source: // userDefinedColorName is nil, so colorNameToUse is set to the default of "red"
ja: （userDefinedColorNameはnilです、なのでcolorNameToUseは省略時の「赤」に設定されます）

source: // userDefinedColorName is not nil, so colorNameToUse is set to "green"
ja: （これはnilではありません、それでcolorNameToUseは「緑」に設定されます）

source: // value is 12
ja: （valueは12です）

source: // valueChanged is of type Int?, not Int
ja: （valueChanged は、型 Int? のものです、Int ではなく）

source: // variableString is now "Horse and carriage"
ja: （variableStringは、現在「馬と馬車」です）
